"""
Все константы должны быть называться большими буквами
постоянные величины (конcтанты)
"""

BASE_STR = '\x1b[;0;34;%sm%s\x1b[0m'

EMPTY_LEVEL = [
        [1, 0, 0, 0, 0, 0, 0, 0, 0, 1],
        [1, 0, 0, 0, 0, 0, 0, 0, 0, 1],
        [1, 0, 0, 0, 0, 0, 0, 0, 0, 1],
        [1, 0, 0, 0, 0, 0, 0, 0, 0, 1],
        [1, 0, 0, 0, 0, 0, 0, 0, 0, 1],
        [1, 0, 0, 0, 0, 0, 0, 0, 0, 1],
        [1, 0, 0, 0, 0, 0, 0, 0, 0, 1],
        [1, 0, 0, 0, 0, 0, 0, 0, 0, 1],
        [1, 0, 0, 0, 0, 0, 0, 0, 0, 1],
        [1, 0, 0, 0, 0, 0, 0, 0, 0, 1],
    ]

EMPTY_LINE = [1, 0, 0, 0, 0, 0, 0, 0, 0, 1]

class color_db:
    red = 41
    green = 42
    black = 40
    yellow = 43
    blue = 44
    purple = 45
    white = 47
    cyan = 46
# ---------------------------------------
